MikroElektronika/mikrosdk_v2/targets/pic_16bit/mikroe/dspic/include/pps/hal_ll_pps_connection_defs/dsPIC33EP128GM706/hal_ll_pps_connection_defs.h
    {PIN_13, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 45, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RB14_RPI46
    {PIN_14, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 46, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RB15_RPI47
    {PIN_15, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 47, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RB2_RPI34
    {PIN_2, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 34, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RB3_RP35
    {PIN_3, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 35, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RB4_RP36
    {PIN_4, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 36, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RB5_RP37
    {PIN_5, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 37, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RB6_RP38
    {PIN_6, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 38, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RB7_RP39
    {PIN_7, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 39, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RB8_RP40
    {PIN_8, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 40, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RB9_RP41
    {PIN_9, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 41, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RC0_RP48
    {PIN_0, PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 48, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RC1_RP49
    {PIN_1, PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 49, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RC10_RPI58
    {PIN_10, PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 58, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RC12_RPI60
    {PIN_12, PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 60, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RC13_RPI61
    {PIN_13, PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 61, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RC15_RPI63
    {PIN_15, PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 63, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RC2_RPI50
    {PIN_2, PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 50, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RC3_RPI51
    {PIN_3, PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 51, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RC4_RPI52
    {PIN_4, PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 52, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RC5_RPI53
    {PIN_5, PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 53, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RC6_RP54
    {PIN_6, PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 54, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RC7_RP55
    {PIN_7, PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 55, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RC8_RP56
    {PIN_8, PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 56, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RC9_RP57
    {PIN_9, PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 57, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RD5_RP69
    {PIN_5, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 69, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RD6_RP70
    {PIN_6, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 70, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RD8_RPI72
    {PIN_8, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 72, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RE14_RPI94
    {PIN_14, PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 94, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RE15_RPI95
    {PIN_15, PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 95, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RF0_RPI96
    {PIN_0, PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 96, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RF1_RP97
    {PIN_1, PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 97, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RG6_RP118
    {PIN_6, PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 118, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RG7_RPI119
    {PIN_7, PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 119, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RG8_RP120
    {PIN_8, PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 120, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RG9_RPI121
    {PIN_9, PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 121, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif

    { HAL_LL_PIN_NC, HAL_LL_PORT_NC, HAL_LL_PIN_NC, HAL_LL_PIN_NC, HAL_LL_PIN_NC, HAL_LL_MODULE_ERROR, HAL_LL_MODULE_ERROR }
};

